In [60]:
import pandas as pd

# 5.1 Introduction to pandas Data Structures

### Series

In [61]:
obj = pd.Series([4, 7, -5, 3])

In [62]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [63]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [64]:
obj.index

RangeIndex(start=0, stop=4, step=1)

## Setting the index values to values other than n - 1

In [65]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [66]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [67]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [68]:
obj2["a"]

-5

In [69]:
obj2["d"] = 6

In [70]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [71]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [72]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [73]:
import numpy as np

In [74]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [75]:
"b" in obj2

True

In [76]:
"e" in obj2

False

## Declare a dict

In [77]:
 sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

## Convert dict to Series

In [78]:
obj3 = pd.Series(sdata)

In [79]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

## Convert Series to dict

In [80]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [81]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [82]:
obj4 = pd.Series(sdata, index=states)

In [83]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

## Check for NA values in obj4

In [84]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## Check for values not NA in obj4

In [85]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [86]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [87]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [88]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [89]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

## Setting the name attribute of the object and index

In [90]:
obj4.name = "population"
obj4.index.name = "state"

In [91]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [92]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

## Altering a Series' index by in place assigment

In [93]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [94]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## Creating a DataFrame from a dictionary of equal length lists

In [95]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [96]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## Selecting first five rows using head method

In [97]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## Selecting last five rows using tail method

In [98]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## Changing sequence of columns

In [100]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

## Passing a non-existent column with return a column with NA values

In [102]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [103]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [104]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

## Retrieving particular columns using dictionary notation

In [105]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

## Retrieving particular columns using dot attribute notation

In [107]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

## Retrieving row by label indexing

In [109]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

## Retrieving row by integer indexing

In [110]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

## Modifying column by scalar assignment

In [111]:
frame2["debt"] = 16.5

In [112]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

## Modifying column by array of values

In [115]:
frame2["debt"] = np.arange(6.)

In [116]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [118]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [119]:
frame2["debt"] = val

In [120]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [124]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [125]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

## Deleting a column

In [126]:
del frame2["eastern"]

In [127]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [128]:
In [72]: populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [129]:
frame3 = pd.DataFrame(populations)

## Converting nested dict to DataFrame, outer dict keys=columns, inner dict keys=row indices

In [130]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

## Transposing rows and columns

In [132]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [133]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [134]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [135]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [136]:
frame3.index.name = "year"
frame3.columns.name = "state"

In [137]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

## Return data in DataFrame as 2D numpy array

In [139]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

## If columns in DF are different data types, data type of array will accomodate all of the columns

In [140]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [141]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index = obj.index

In [142]:
index

Index(['a', 'b', 'c'], dtype='object')

In [143]:
index[1:]

Index(['b', 'c'], dtype='object')

In [145]:
# index[1] = "d" # Type Error

In [146]:
labels = pd.Index(np.arange(3))

In [147]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [148]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [149]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [150]:
obj2.index is labels

True

In [151]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [152]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [153]:
"Ohio" in frame3.columns

True

In [154]:
2003 in frame3.columns

False

## pandas Index can contain duplicate labels

In [156]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [157]:
obj

a    0
b    1
c    2
dtype: int64

In [158]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [159]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

## Using reindex to rearrange data according to new index

In [162]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [163]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [165]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [166]:
obj3

0      blue
2    purple
4    yellow
dtype: object

## Forward fill index values

In [167]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [169]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=["a", "c", "d"], columns=["Ohio", "Texas", "California"])

In [170]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [171]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [172]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

## Columns can be reindexed with the columns keyword

In [174]:
states = ["Texas", "Utah", "California"]

In [175]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

## Reindexing using the axis keyword

In [176]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [177]:
## Reindexing using loc

In [178]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [179]:
## Dropping Entries from and Axis

In [182]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [183]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [184]:
new_obj = obj.drop("c")

In [185]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [186]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [187]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [188]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Calling drop on sequence of labels will drop values from the row labels

In [189]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [190]:
# Drop labels from columns using columns keyword

In [191]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [192]:
## Dropping values from columns using axis keyword

In [193]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [194]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [ ]:
## Indexing, Selection, and Filtering

In [199]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [200]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [201]:
obj["b"]

1.0

In [202]:
obj[1]

1.0

In [203]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [205]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [206]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [209]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [210]:
## Selecting index values using the loc operator

In [211]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [212]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [213]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [214]:
obj1

2    1
0    2
1    3
dtype: int64

In [215]:
obj2

a    1
b    2
c    3
dtype: int64

In [216]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [217]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [218]:
## Using the iloc operator

In [220]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [221]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [222]:
## Slicing with labels is inclusive

In [223]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [224]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [225]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [226]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [227]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [228]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [229]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
##

In [230]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
##